tests/integration/mutations/240-open-keeps-capabilities.patch
# case: 240-open-drops-capabilities
# what: open mode's agent shell keeps cap_net_raw across the handover, via the
#       ambient set. PID 1 still becomes the sandbox user, so the handover
#       succeeds and 240 fails on its own assert_no_capability rather than dying
#       in sandbox_up: pid1_caps reads CapEff and finds cap_net_raw present.
#
#       THREE OBVIOUS MUTATIONS ARE EQUIVALENT AND ALL WERE REJECTED. Measured
#       in the integration image, CapEff of the process capsh execs:
#
#         root, no setuid                                     a80425fb
#         --drop=cap_net_admin,cap_net_raw --user=probe        00000000
#         --keep=1 --user=probe                                00000000
#         --keep=1 --user=probe --inh=… --addamb=…             00002000  (cap_net_raw)
#
#       So deleting --drop= does NOT fail this case, and neither does --keep=1
#       alone, and neither would granting --cap-add to open mode in sandbox_up:
#       none of them changes CapEff. `capsh --user=` setuids from root and the
#       kernel clears the permitted and effective sets on that transition, which
#       is what empties the agent shell — the --drop= flag is belt-and-braces
#       over a guarantee the setuid already gives. PR_SET_KEEPCAPS (--keep=1)
#       preserves PERMITTED, not EFFECTIVE, so it does not help either.
#
#       The ambient set is the one path that survives a root→non-root setuid and
#       lands in EFFECTIVE, so it is the only damage found that both reaches
#       240's assertion and leaves the case otherwise runnable. --keep=1 is
#       required for it: --addamb needs the capability in permitted, which only
#       KEEPCAPS preserves past the --user. The option ORDER matters and matches
#       the measurement above; do not reorder it.
#
#       230 (discovery) shares pid1_caps but not this branch, so it is untouched
#       and still passes — the coverage 240 adds. Needs a rebuild: entrypoint.sh
#       is COPYed by the Dockerfile, and demonstrate-network-delivery-tiers.sh derives that
#       automatically.
#
diff --git a/entrypoint.sh b/entrypoint.sh
index d4817a6..4238b98 100755
--- a/entrypoint.sh
+++ b/entrypoint.sh
@@ -306,14 +306,16 @@ case "$mode" in
     link_default_ruby
     run_agent_tools_reconcile
     link_agent_tools
     run_agent_skill_install
 
     exec capsh \
-      --drop=cap_net_admin,cap_net_raw \
+      --keep=1 \
       --user="$sandbox_user" \
+      --inh=cap_net_raw \
+      --addamb=cap_net_raw \
       -- -l
     ;;
   *)
     printf 'Unsupported DEV_CONTAINER_MODE: %s\n' "$mode" >&2
     exit 1
     ;;
