tests/integration/mutations/420-collision-only-warns.patch
# case: 420-collision-launches-nothing
# what: the /workspace name collision prints its error and launches anyway, letting one mount silently shadow the other
#
diff --git a/sandbox.sh b/sandbox.sh
index ded2e31..8d61c31 100755
--- a/sandbox.sh
+++ b/sandbox.sh
@@ -406,7 +406,7 @@ run_container() {
       if [[ -n "${repos_used[$rname]:-}" ]]; then
         printf "ERROR: name '%s' is used by both %s and REPOS — they both mount at /workspace/%s.\n" \
           "$rname" "${repos_used[$rname]}" "$rname" >&2
-        exit 1
+        : # MUTATION: refusal downgraded to a warning
       fi
       if ! repo_is_registered "$rname"; then
         printf "ERROR: REPOS entry '%s' is not a registered repo.\n" "$rname" >&2
