tests/integration/mutations/070-pid1-caps-fresh-exec.patch
# case: 070-restricted-drops-capabilities
# what: pid1_caps reads the fresh exec own /proc/self/status instead of PID 1, so both dropped capabilities are reported present
#
diff --git a/tests/integration/lib.sh b/tests/integration/lib.sh
index 604c9d5..35b0212 100644
--- a/tests/integration/lib.sh
+++ b/tests/integration/lib.sh
@@ -671,8 +671,11 @@ reach() {  # $1=cid $2=host-or-ip [$3=port]
 # from `exec capsh --drop=…`, so asking it directly would report NET_ADMIN
 # present in a container that correctly dropped it.
 pid1_caps() {  # $1=cid
+  # KNOWN-BAD: read the FRESH exec's own /proc/self/status instead of PID 1's.
+  # This is the plausible wrong implementation — `docker exec` starts from the
+  # container's capability BOUNDING SET and inherits none of capsh's drops.
   docker exec "$1" bash -c \
-    'capsh --decode=$(sed -n "s/^CapEff:[[:space:]]*//p" /proc/1/status) 2>/dev/null' 2>/dev/null
+    'capsh --decode=$(sed -n "s/^CapEff:[[:space:]]*//p" /proc/self/status) 2>/dev/null' 2>/dev/null
 }
 
 blocked_entries() {  # $1=cid [$2=file basename]
