tests/integration/mutations/440-preview-ports-not-published.patch
# case: 440-preview-ports-published
# what: PREVIEW_PORTS produces no -p flags, so nothing is published to the host
#
diff --git a/sandbox.sh b/sandbox.sh
index 0c06aaf..f43b781 100755
--- a/sandbox.sh
+++ b/sandbox.sh
@@ -769,7 +769,7 @@ run_container() {
   local port_flags=()
   if [[ -n "${PREVIEW_PORTS:-}" ]]; then
     while IFS= read -r p; do
-      port_flags+=(-p "$p")
+      : # MUTATION: -p flag dropped
     done < <(split_env_list "$PREVIEW_PORTS")
   fi
 
