tests/integration/mutations/720-npmrc-prefix-restored.patch
# case: 720-node-multiversion-nvm-use
# what: /etc/skel/.npmrc is re-baked with prefix=${HOME}/.ai-tools/npm -- the exact
#       regression that broke `nvm use`. nvm's nvm_die_on_prefix check fails `nvm use
#       <version>` outright (not a warning) whenever $HOME/.npmrc sets a prefix, so the
#       node=22,20 multi-version workflow breaks the instant ~/.ai-tools is populated.
#
diff --git a/Dockerfile b/Dockerfile
--- a/Dockerfile
+++ b/Dockerfile
@@ -682,7 +682,8 @@ RUN chmod +x /usr/local/bin/link-default-ruby.sh
 # directory on PATH exposes all of it, and `copilot` ran in a project with copilot=OFF.
 # link-agent-tools.sh links exactly this project's AI_RUNTIME_TOOLS into /usr/local/bin,
 # which every shell already has, so that is the one route onto PATH.
-RUN install -d /etc/skel/.local/bin && \
+RUN printf 'prefix=${HOME}/.ai-tools/npm\n' > /etc/skel/.npmrc && \
+    install -d /etc/skel/.local/bin && \
     printf '%s\n' \
       'export UV_TOOL_DIR="$HOME/.ai-tools/uv"' \
       'export UV_TOOL_BIN_DIR="$HOME/.ai-tools/uv/bin"' \
